package Future.Tech.company.bianlifeng;

/**
 * 三、
 *         最短路径
 *         时间限制： 4000MS
 *         内存限制： 589824KB
 *         题目描述：
 *         假设有一个矩阵，矩阵由 0 和 1 数字组成。其中1代表这个节点可达，0代表这个节点不可达，从左上角第一个节点出发到右下角最后一个节点，只能上下左右移动，初始节点数为 1，移动一步节点数加 1，问最少需要经过多少节点可以达到。
 *
 *         请实现计算最短路径的函数。如果不可达返回0。
 *
 *         举例1、
 *
 *         输入：1
 *
 *         输出：1
 *
 *
 *
 *         举例2、
 *
 *         输入：1,1
 *
 *         输出：2
 *
 *
 *
 *         举例3、
 *
 *         输入：1,0;1,0
 *
 *         输出： 0
 *         矩阵数组，每行之间用”;"分隔，同一行内用","分隔
 *         返回最短距离
 *         1,0,1,1;1,1,1,1;1,1,0,1;0,0,0,1
 *         7
 */
public class Third {
}
